quest_system_1898895593_name=^?^Pirate's Crops
quest_system_1898895593_stage_0=^?^You are to gather five bushes which were planted by the pirate Hornet in a secret cave.<br>Gathered: [count]/5.
quest_system_1898895593_stage_1=^?^Return to Hornet and give him the plants.
quest_system_1898895593_task=^?^Instead of collecting the money you owe him, Hornet has asked you to bring him an herb, which he once planted in a secret cave on the Eastern Islands of Freedom. Locate the island on which you will find a secret cave, marked with a cross and skull. To gain entrance, simply press the skull.<br>[reward]
